leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCcu6_regdef.h
/** \brief  Capture/Compare Shadow Reg. for Channel CC61 */
typedef struct _Ifx_CCU6_CC61SR_Bits
{
    unsigned int CCS:16;                    /**< \brief [15:0] Shadow Register for Channel x Capture/Compare Value (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_CC61SR_Bits;

/** \brief  Capture/Compare Register for Channel CC62 */
typedef struct _Ifx_CCU6_CC62R_Bits
{
    unsigned int CCV:16;                    /**< \brief [15:0] Capture/Compare Value (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_CC62R_Bits;

/** \brief  Capture/Compare Shadow Reg. for Channel CC62 */
typedef struct _Ifx_CCU6_CC62SR_Bits
{
    unsigned int CCS:16;                    /**< \brief [15:0] Shadow Register for Channel x Capture/Compare Value (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_CC62SR_Bits;

/** \brief  Compare Register for T13 */
typedef struct _Ifx_CCU6_CC63R_Bits
{
    unsigned int CCV:16;                    /**< \brief [15:0] Channel CC63 Compare Value (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_CC63R_Bits;

/** \brief  Compare Shadow Register for T13 */
typedef struct _Ifx_CCU6_CC63SR_Bits
{
    unsigned int CCS:16;                    /**< \brief [15:0] Shadow Register for Channel CC63 Compare Value (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_CC63SR_Bits;

/** \brief  Clock Control Register */
typedef struct _Ifx_CCU6_CLC_Bits
{
    unsigned int DISR:1;                    /**< \brief [0:0] Module Disable Request Bit (rw) */
    unsigned int DISS:1;                    /**< \brief [1:1] Module Disable Status Bit (rh) */
    unsigned int reserved_2:1;              /**< \brief \internal Reserved */
    unsigned int EDIS:1;                    /**< \brief [3:3] Sleep Mode Enable Control (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_CCU6_CLC_Bits;

/** \brief  Compare State Modification Register */
typedef struct _Ifx_CCU6_CMPMODIF_Bits
{
    unsigned int MCC60S:1;                  /**< \brief [0:0] Capture/Compare Status Modification Bits (w) */
    unsigned int MCC61S:1;                  /**< \brief [1:1] Capture/Compare Status Modification Bits (w) */
    unsigned int MCC62S:1;                  /**< \brief [2:2] Capture/Compare Status Modification Bits (w) */
    unsigned int reserved_3:3;              /**< \brief \internal Reserved */
    unsigned int MCC63S:1;                  /**< \brief [6:6] Capture/Compare Status Modification Bits (w) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int MCC60R:1;                  /**< \brief [8:8] Capture/Compare Status Modification Bits (w) */
    unsigned int MCC61R:1;                  /**< \brief [9:9] Capture/Compare Status Modification Bits (w) */
    unsigned int MCC62R:1;                  /**< \brief [10:10] Capture/Compare Status Modification Bits (w) */
    unsigned int reserved_11:3;             /**< \brief \internal Reserved */
    unsigned int MCC63R:1;                  /**< \brief [14:14] Capture/Compare Status Modification Bits (w) */
    unsigned int reserved_15:17;            /**< \brief \internal Reserved */
} Ifx_CCU6_CMPMODIF_Bits;

/** \brief  Compare State Register */
typedef struct _Ifx_CCU6_CMPSTAT_Bits
{
    unsigned int CC60ST:1;                  /**< \brief [0:0] Capture/Compare State Bits (rh) */
    unsigned int CC61ST:1;                  /**< \brief [1:1] Capture/Compare State Bits (rh) */
    unsigned int CC62ST:1;                  /**< \brief [2:2] Capture/Compare State Bits (rh) */
    unsigned int CCPOS60:1;                 /**< \brief [3:3] Sampled Hall Pattern Bits (rh) */
    unsigned int CCPOS61:1;                 /**< \brief [4:4] Sampled Hall Pattern Bits (rh) */
    unsigned int CCPOS62:1;                 /**< \brief [5:5] Sampled Hall Pattern Bits (rh) */
    unsigned int CC63ST:1;                  /**< \brief [6:6] Capture/Compare State Bits (rh) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int CC60PS:1;                  /**< \brief [8:8] Passive State Select for Compare Outputs (rwh) */
    unsigned int COUT60PS:1;                /**< \brief [9:9] Passive State Select for Compare Outputs (rwh) */
    unsigned int CC61PS:1;                  /**< \brief [10:10] Passive State Select for Compare Outputs (rwh) */
    unsigned int COUT61PS:1;                /**< \brief [11:11] Passive State Select for Compare Outputs (rwh) */
    unsigned int CC62PS:1;                  /**< \brief [12:12] Passive State Select for Compare Outputs (rwh) */
    unsigned int COUT62PS:1;                /**< \brief [13:13] Passive State Select for Compare Outputs (rwh) */
    unsigned int COUT63PS:1;                /**< \brief [14:14] Passive State Select for Compare Outputs (rwh) */
    unsigned int T13IM:1;                   /**< \brief [15:15] T13 Inverted Modulation (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_CMPSTAT_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_CCU6_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODNUMBER:8;               /**< \brief [15:8] Module Number Value (r) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_ID_Bits;

/** \brief  Interrupt Enable Register */
typedef struct _Ifx_CCU6_IEN_Bits
{
    unsigned int ENCC60R:1;                 /**< \brief [0:0] Capture, Compare-Match Rising Edge Interrupt Enable for Channel CC6x (rw) */
    unsigned int ENCC60F:1;                 /**< \brief [1:1] Capture, Compare-Match Falling Edge Interrupt Enable for Channel CC6x (rw) */
    unsigned int ENCC61R:1;                 /**< \brief [2:2] Capture, Compare-Match Rising Edge Interrupt Enable for Channel CC6x (rw) */
    unsigned int ENCC61F:1;                 /**< \brief [3:3] Capture, Compare-Match Falling Edge Interrupt Enable for Channel CC6x (rw) */
    unsigned int ENCC62R:1;                 /**< \brief [4:4] Capture, Compare-Match Rising Edge Interrupt Enable for Channel CC6x (rw) */
    unsigned int ENCC62F:1;                 /**< \brief [5:5] Capture, Compare-Match Falling Edge Interrupt Enable for Channel CC6x (rw) */
    unsigned int ENT12OM:1;                 /**< \brief [6:6] Enable Interrupt for T12 One-Match (rw) */
    unsigned int ENT12PM:1;                 /**< \brief [7:7] Enable Interrupt for T12 Period-Match (rw) */
    unsigned int ENT13CM:1;                 /**< \brief [8:8] Enable Interrupt for T13 Compare-Match (rw) */
    unsigned int ENT13PM:1;                 /**< \brief [9:9] Enable Interrupt for T13 Period-Match (rw) */
    unsigned int ENTRPF:1;                  /**< \brief [10:10] Enable Interrupt for Trap Flag (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int ENCHE:1;                   /**< \brief [12:12] Enable Interrupt for Correct Hall Event (rw) */
    unsigned int ENWHE:1;                   /**< \brief [13:13] Enable Interrupt for Wrong Hall Event (rw) */
    unsigned int ENIDLE:1;                  /**< \brief [14:14] Enable Idle (rw) */
    unsigned int ENSTR:1;                   /**< \brief [15:15] Enable Multi-Channel Mode Shadow Transfer Interrupt (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_IEN_Bits;

/** \brief  Input Monitoring Register */
typedef struct _Ifx_CCU6_IMON_Bits
{
    unsigned int LBE:1;                     /**< \brief [0:0] Lost Bit Event (rwh) */
    unsigned int CCPOS0I:1;                 /**< \brief [1:1] Event indication for input signal CCPOS0 (rwh) */
    unsigned int CCPOS1I:1;                 /**< \brief [2:2] Event indication for input signal CCPOS1 (rwh) */
    unsigned int CCPOS2I:1;                 /**< \brief [3:3] Event indication for input signal CCPOS2 (rwh) */
    unsigned int CC60INI:1;                 /**< \brief [4:4] Event indication for input signal CC60IN (rwh) */
    unsigned int CC61INI:1;                 /**< \brief [5:5] Event indication for input signal CC61IN (rwh) */
    unsigned int CC62INI:1;                 /**< \brief [6:6] Event indication for input signal CC62IN (rwh) */
    unsigned int CTRAPI:1;                  /**< \brief [7:7] Event indication for input signal CTRAP (rwh) */
    unsigned int T12HRI:1;                  /**< \brief [8:8] Event indication for input signal T12HR (rwh) */
    unsigned int T13HRI:1;                  /**< \brief [9:9] Event indication for input signal T13HR (rwh) */
    unsigned int reserved_10:22;            /**< \brief \internal Reserved */
} Ifx_CCU6_IMON_Bits;

/** \brief  Interrupt Node Pointer Register */
typedef struct _Ifx_CCU6_INP_Bits
{
    unsigned int INPCC60:2;                 /**< \brief [1:0] Interrupt Node Pointer for Channel CC6x Interrupts (rw) */
    unsigned int INPCC61:2;                 /**< \brief [3:2] Interrupt Node Pointer for Channel CC6x Interrupts (rw) */
    unsigned int INPCC62:2;                 /**< \brief [5:4] Interrupt Node Pointer for Channel CC6x Interrupts (rw) */
    unsigned int INPCHE:2;                  /**< \brief [7:6] Interrupt Node Pointer for the CHE Interrupt (rw) */
    unsigned int INPERR:2;                  /**< \brief [9:8] Interrupt Node Pointer for Error Interrupts (rw) */
    unsigned int INPT12:2;                  /**< \brief [11:10] Interrupt Node Pointer for Timer12 Interrupts (rw) */
    unsigned int INPT13:2;                  /**< \brief [13:12] Interrupt Node Pointer for Timer13 Interrupt (rw) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_CCU6_INP_Bits;

/** \brief  Interrupt Status Register */
typedef struct _Ifx_CCU6_IS_Bits
{
    unsigned int ICC60R:1;                  /**< \brief [0:0] Capture, Compare-Match Rising Edge Flag (rh) */
    unsigned int ICC60F:1;                  /**< \brief [1:1] Capture, Compare-Match Falling Edge Flag (rh) */
    unsigned int ICC61R:1;                  /**< \brief [2:2] Capture, Compare-Match Rising Edge Flag (rh) */
    unsigned int ICC61F:1;                  /**< \brief [3:3] Capture, Compare-Match Falling Edge Flag (rh) */
    unsigned int ICC62R:1;                  /**< \brief [4:4] Capture, Compare-Match Rising Edge Flag (rh) */
    unsigned int ICC62F:1;                  /**< \brief [5:5] Capture, Compare-Match Falling Edge Flag (rh) */
    unsigned int T12OM:1;                   /**< \brief [6:6] Timer T12 One-Match Flag (rh) */
    unsigned int T12PM:1;                   /**< \brief [7:7] Timer T12 Period-Match Flag (rh) */
    unsigned int T13CM:1;                   /**< \brief [8:8] Timer T13 Compare-Match Flag (rh) */
    unsigned int T13PM:1;                   /**< \brief [9:9] Timer T13 Period-Match Flag (rh) */
    unsigned int TRPF:1;                    /**< \brief [10:10] Trap Flag (rh) */
    unsigned int TRPS:1;                    /**< \brief [11:11] Trap State (rh) */
    unsigned int CHE:1;                     /**< \brief [12:12] Correct Hall Event (rh) */
    unsigned int WHE:1;                     /**< \brief [13:13] Wrong Hall Event (rh) */
    unsigned int IDLE:1;                    /**< \brief [14:14] IDLE State (rh) */
    unsigned int STR:1;                     /**< \brief [15:15] Multi-Channel Mode Shadow Transfer Request (rh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_IS_Bits;

/** \brief  Interrupt Status Reset Register */
typedef struct _Ifx_CCU6_ISR_Bits
{
    unsigned int RCC60R:1;                  /**< \brief [0:0] Reset Capture, Compare-Match Rising Edge Flag (w) */
    unsigned int RCC60F:1;                  /**< \brief [1:1] Reset Capture, Compare-Match Falling Edge Flag (w) */
    unsigned int RCC61R:1;                  /**< \brief [2:2] Reset Capture, Compare-Match Rising Edge Flag (w) */
    unsigned int RCC61F:1;                  /**< \brief [3:3] Reset Capture, Compare-Match Falling Edge Flag (w) */
    unsigned int RCC62R:1;                  /**< \brief [4:4] Reset Capture, Compare-Match Rising Edge Flag (w) */
    unsigned int RCC62F:1;                  /**< \brief [5:5] Reset Capture, Compare-Match Falling Edge Flag (w) */
    unsigned int RT12OM:1;                  /**< \brief [6:6] Reset Timer T12 One-Match Flag (w) */
    unsigned int RT12PM:1;                  /**< \brief [7:7] Reset Timer T12 Period-Match Flag (w) */
    unsigned int RT13CM:1;                  /**< \brief [8:8] Reset Timer T13 Compare-Match Flag (w) */
    unsigned int RT13PM:1;                  /**< \brief [9:9] Reset Timer T13 Period-Match Flag (w) */
    unsigned int RTRPF:1;                   /**< \brief [10:10] Reset Trap Flag (w) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int RCHE:1;                    /**< \brief [12:12] Reset Correct Hall Event Flag (w) */
    unsigned int RWHE:1;                    /**< \brief [13:13] Reset Wrong Hall Event Flag (w) */
    unsigned int RIDLE:1;                   /**< \brief [14:14] Reset IDLE Flag (w) */
    unsigned int RSTR:1;                    /**< \brief [15:15] Reset STR Flag (w) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_ISR_Bits;

/** \brief  Interrupt Status Set Register */
typedef struct _Ifx_CCU6_ISS_Bits
{
    unsigned int SCC60R:1;                  /**< \brief [0:0] Set Capture, Compare-Match Rising Edge Flag (w) */
    unsigned int SCC60F:1;                  /**< \brief [1:1] Set Capture, Compare-Match Falling Edge Flag (w) */
    unsigned int SCC61R:1;                  /**< \brief [2:2] Set Capture, Compare-Match Rising Edge Flag (w) */
    unsigned int SCC61F:1;                  /**< \brief [3:3] Set Capture, Compare-Match Falling Edge Flag (w) */
    unsigned int SCC62R:1;                  /**< \brief [4:4] Set Capture, Compare-Match Rising Edge Flag (w) */
    unsigned int SCC62F:1;                  /**< \brief [5:5] Set Capture, Compare-Match Falling Edge Flag (w) */
    unsigned int ST12OM:1;                  /**< \brief [6:6] Set Timer T12 One-Match Flag (w) */
    unsigned int ST12PM:1;                  /**< \brief [7:7] Set Timer T12 Period-Match Flag (w) */
    unsigned int ST13CM:1;                  /**< \brief [8:8] Set Timer T13 Compare-Match Flag (w) */
    unsigned int ST13PM:1;                  /**< \brief [9:9] Set Timer T13 Period-Match Flag (w) */
    unsigned int STRPF:1;                   /**< \brief [10:10] Set Trap Flag (w) */
    unsigned int SWHC:1;                    /**< \brief [11:11] Software Hall Compare (w) */
    unsigned int SCHE:1;                    /**< \brief [12:12] Set Correct Hall Event Flag (w) */
    unsigned int SWHE:1;                    /**< \brief [13:13] Set Wrong Hall Event Flag (w) */
    unsigned int SIDLE:1;                   /**< \brief [14:14] Set IDLE Flag (w) */
    unsigned int SSTR:1;                    /**< \brief [15:15] Set STR Flag (w) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_ISS_Bits;

/** \brief  Kernel Reset Register 0 */
typedef struct _Ifx_CCU6_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_CCU6_KRST0_Bits;

/** \brief  Kernel Reset Register 1 */
typedef struct _Ifx_CCU6_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_CCU6_KRST1_Bits;

