leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCcu6_regdef.h
/** \brief  Kernel Reset Status Clear Register */
typedef struct _Ifx_CCU6_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_CCU6_KRSTCLR_Bits;

/** \brief  Kernel State Control Sensitivity Register */
typedef struct _Ifx_CCU6_KSCSR_Bits
{
    unsigned int SB0:1;                     /**< \brief [0:0] Sensitivity Block x (rw) */
    unsigned int SB1:1;                     /**< \brief [1:1] Sensitivity Block x (rw) */
    unsigned int SB2:1;                     /**< \brief [2:2] Sensitivity Block x (rw) */
    unsigned int SB3:1;                     /**< \brief [3:3] Sensitivity Block x (rw) */
    unsigned int reserved_4:28;             /**< \brief \internal Reserved */
} Ifx_CCU6_KSCSR_Bits;

/** \brief  Lost Indicator Register */
typedef struct _Ifx_CCU6_LI_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int CCPOS0EN:1;                /**< \brief [1:1] Lost Indicator Enable for input signal CCPOS0 (rw) */
    unsigned int CCPOS1EN:1;                /**< \brief [2:2] Lost Indicator Enable for input signal CCPOS1 (rw) */
    unsigned int CCPOS2EN:1;                /**< \brief [3:3] Lost Indicator Enable for input signal CCPOS2 (rw) */
    unsigned int CC60INEN:1;                /**< \brief [4:4] Lost Indicator Enable for input signal CC60IN (rw) */
    unsigned int CC61INEN:1;                /**< \brief [5:5] Lost Indicator Enable for input signal CC61IN (rw) */
    unsigned int CC62INEN:1;                /**< \brief [6:6] Lost Indicator Enable for input signal CC62IN (rw) */
    unsigned int CTRAPEN:1;                 /**< \brief [7:7] Lost Indicator Enable for input signal CTRAP (rw) */
    unsigned int T12HREN:1;                 /**< \brief [8:8] Lost Indicator Enable for input signal T12HR (rw) */
    unsigned int T13HREN:1;                 /**< \brief [9:9] Lost Indicator Enable for input signal T13HR (rw) */
    unsigned int reserved_10:3;             /**< \brief \internal Reserved */
    unsigned int LBEEN:1;                   /**< \brief [13:13] Interrupt Enable for Lost Bit Event (rw) */
    unsigned int INPLBE:2;                  /**< \brief [15:14] Interrupt Node Pointer for lost bit event (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_LI_Bits;

/** \brief  Module Configuration Register */
typedef struct _Ifx_CCU6_MCFG_Bits
{
    unsigned int T12:1;                     /**< \brief [0:0] T12 Available (r) */
    unsigned int T13:1;                     /**< \brief [1:1] T13 Available (r) */
    unsigned int MCM:1;                     /**< \brief [2:2] Multi-Channel Mode Available (r) */
    unsigned int reserved_3:29;             /**< \brief \internal Reserved */
} Ifx_CCU6_MCFG_Bits;

/** \brief  Multi-Channel Mode Control Register */
typedef struct _Ifx_CCU6_MCMCTR_Bits
{
    unsigned int SWSEL:3;                   /**< \brief [2:0] Switching Selection (rw) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int SWSYN:2;                   /**< \brief [5:4] Switching Synchronization (rw) */
    unsigned int reserved_6:2;              /**< \brief \internal Reserved */
    unsigned int STE12U:1;                  /**< \brief [8:8] Shadow Transfer Enable for T12 Upcounting (rw) */
    unsigned int STE12D:1;                  /**< \brief [9:9] Shadow Transfer Enable for T12 Downcounting (rw) */
    unsigned int STE13U:1;                  /**< \brief [10:10] Shadow Transfer Enable for T13 Upcounting (rw) */
    unsigned int reserved_11:21;            /**< \brief \internal Reserved */
} Ifx_CCU6_MCMCTR_Bits;

/** \brief  Multi-Channel Mode Output Register */
typedef struct _Ifx_CCU6_MCMOUT_Bits
{
    unsigned int MCMP:6;                    /**< \brief [5:0] Multi-Channel PWM Pattern (rh) */
    unsigned int R:1;                       /**< \brief [6:6] Reminder Flag (rh) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int EXPH:3;                    /**< \brief [10:8] Expected Hall Pattern (rh) */
    unsigned int CURH:3;                    /**< \brief [13:11] Current Hall Pattern (rh) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_CCU6_MCMOUT_Bits;

/** \brief  Multi-Channel Mode Output Shadow Register */
typedef struct _Ifx_CCU6_MCMOUTS_Bits
{
    unsigned int MCMPS:6;                   /**< \brief [5:0] Multi-Channel PWM Pattern Shadow (rw) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int STRMCM:1;                  /**< \brief [7:7] Shadow Transfer Request for MCMPS (w) */
    unsigned int EXPHS:3;                   /**< \brief [10:8] Expected Hall Pattern Shadow (rw) */
    unsigned int CURHS:3;                   /**< \brief [13:11] Current Hall Pattern Shadow (rw) */
    unsigned int reserved_14:1;             /**< \brief \internal Reserved */
    unsigned int STRHP:1;                   /**< \brief [15:15] Shadow Transfer Request for the Hall Pattern (w) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_MCMOUTS_Bits;

/** \brief  Modulation Control Register */
typedef struct _Ifx_CCU6_MODCTR_Bits
{
    unsigned int T12MODEN:6;                /**< \brief [5:0] T12 Modulation Enable (rw) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int MCMEN:1;                   /**< \brief [7:7] Multi-Channel Mode Enable (rw) */
    unsigned int T13MODEN:6;                /**< \brief [13:8] T13 Modulation Enable (rw) */
    unsigned int reserved_14:1;             /**< \brief \internal Reserved */
    unsigned int ECT13O:1;                  /**< \brief [15:15] Enable Compare Timer T13 Output (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_MODCTR_Bits;

/** \brief  CCU60 Module Output Select Register */
typedef struct _Ifx_CCU6_MOSEL_Bits
{
    unsigned int TRIG0SEL:3;                /**< \brief [2:0]  (rw) */
    unsigned int TRIG1SEL:3;                /**< \brief [5:3]  (rw) */
    unsigned int TRIG2SEL:3;                /**< \brief [8:6]  (rw) */
    unsigned int reserved_9:23;             /**< \brief \internal Reserved */
} Ifx_CCU6_MOSEL_Bits;

/** \brief  OCDS Control and Status Register */
typedef struct _Ifx_CCU6_OCS_Bits
{
    unsigned int TGS:2;                     /**< \brief [1:0] Trigger Set for OTGB0/1 (rw) */
    unsigned int TGB:1;                     /**< \brief [2:2] OTGB0/1 Bus Select (rw) */
    unsigned int TG_P:1;                    /**< \brief [3:3] TGS, TGB Write Protection (w) */
    unsigned int reserved_4:20;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_CCU6_OCS_Bits;

/** \brief  Port Input Select Register 0 */
typedef struct _Ifx_CCU6_PISEL0_Bits
{
    unsigned int ISCC60:2;                  /**< \brief [1:0] Input Select for CC60 (rw) */
    unsigned int ISCC61:2;                  /**< \brief [3:2] Input Select for CC61 (rw) */
    unsigned int ISCC62:2;                  /**< \brief [5:4] Input Select for CC62 (rw) */
    unsigned int ISTRP:2;                   /**< \brief [7:6] Input Select for CTRAP (rw) */
    unsigned int ISPOS0:2;                  /**< \brief [9:8] Input Select for CCPOS0 (rw) */
    unsigned int ISPOS1:2;                  /**< \brief [11:10] Input Select for CCPOS1 (rw) */
    unsigned int ISPOS2:2;                  /**< \brief [13:12] Input Select for CCPOS2 (rw) */
    unsigned int IST12HR:2;                 /**< \brief [15:14] Input Select for T12HR (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_PISEL0_Bits;

/** \brief  Port Input Select Register 2 */
typedef struct _Ifx_CCU6_PISEL2_Bits
{
    unsigned int IST13HR:2;                 /**< \brief [1:0] Input Select for T13HR (rw) */
    unsigned int ISCNT12:2;                 /**< \brief [3:2] Input Select for T12 Counting Input (rw) */
    unsigned int ISCNT13:2;                 /**< \brief [5:4] Input Select for T13 Counting Input (rw) */
    unsigned int T12EXT:1;                  /**< \brief [6:6] Extension for T12HR Inputs (rw) */
    unsigned int T13EXT:1;                  /**< \brief [7:7] Extension for T13HR Inputs (rw) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_CCU6_PISEL2_Bits;

/** \brief  Passive State Level Register */
typedef struct _Ifx_CCU6_PSLR_Bits
{
    unsigned int PSL:6;                     /**< \brief [5:0] Compare Outputs Passive State Level (rwh) */
    unsigned int reserved_6:1;              /**< \brief \internal Reserved */
    unsigned int PSL63:1;                   /**< \brief [7:7] Passive State Level of Output COUT63 (rwh) */
    unsigned int reserved_8:24;             /**< \brief \internal Reserved */
} Ifx_CCU6_PSLR_Bits;

/** \brief  Timer T12 Counter Register */
typedef struct _Ifx_CCU6_T12_Bits
{
    unsigned int T12CV:16;                  /**< \brief [15:0] Timer 12 Counter Value (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_T12_Bits;

/** \brief  Dead-Time Control Register for Timer12 */
typedef struct _Ifx_CCU6_T12DTC_Bits
{
    unsigned int DTM:8;                     /**< \brief [7:0] Dead-Time (rw) */
    unsigned int DTE0:1;                    /**< \brief [8:8] Dead Time Enable Bits (rw) */
    unsigned int DTE1:1;                    /**< \brief [9:9] Dead Time Enable Bits (rw) */
    unsigned int DTE2:1;                    /**< \brief [10:10] Dead Time Enable Bits (rw) */
    unsigned int reserved_11:1;             /**< \brief \internal Reserved */
    unsigned int DTR0:1;                    /**< \brief [12:12] Dead Time Run Indication Bits (rh) */
    unsigned int DTR1:1;                    /**< \brief [13:13] Dead Time Run Indication Bits (rh) */
    unsigned int DTR2:1;                    /**< \brief [14:14] Dead Time Run Indication Bits (rh) */
    unsigned int reserved_15:17;            /**< \brief \internal Reserved */
} Ifx_CCU6_T12DTC_Bits;

/** \brief  T12 Mode Select Register */
typedef struct _Ifx_CCU6_T12MSEL_Bits
{
    unsigned int MSEL60:4;                  /**< \brief [3:0] Capture/Compare Mode Selection (rw) */
    unsigned int MSEL61:4;                  /**< \brief [7:4] Capture/Compare Mode Selection (rw) */
    unsigned int MSEL62:4;                  /**< \brief [11:8] Capture/Compare Mode Selection (rw) */
    unsigned int HSYNC:3;                   /**< \brief [14:12] Hall Synchronization (rw) */
    unsigned int DBYP:1;                    /**< \brief [15:15] Delay Bypass (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_T12MSEL_Bits;

