leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxCcu6_regdef.h
/** \brief  Timer 12 Period Register */
typedef struct _Ifx_CCU6_T12PR_Bits
{
    unsigned int T12PV:16;                  /**< \brief [15:0] T12 Period Value (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_T12PR_Bits;

/** \brief  Timer T13 Counter Register */
typedef struct _Ifx_CCU6_T13_Bits
{
    unsigned int T13CV:16;                  /**< \brief [15:0] Timer 13 Counter Value (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_T13_Bits;

/** \brief  Timer 13 Period Register */
typedef struct _Ifx_CCU6_T13PR_Bits
{
    unsigned int T13PV:16;                  /**< \brief [15:0] T13 Period Value (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_T13PR_Bits;

/** \brief  Timer Control Register 0 */
typedef struct _Ifx_CCU6_TCTR0_Bits
{
    unsigned int T12CLK:3;                  /**< \brief [2:0] Timer T12 Input Clock Select (rw) */
    unsigned int T12PRE:1;                  /**< \brief [3:3] Timer T12 Prescaler Bit (rw) */
    unsigned int T12R:1;                    /**< \brief [4:4] Timer T12 Run Bit (rh) */
    unsigned int STE12:1;                   /**< \brief [5:5] Timer T12 Shadow Transfer Enable (rh) */
    unsigned int CDIR:1;                    /**< \brief [6:6] Count Direction of Timer T12 (rh) */
    unsigned int CTM:1;                     /**< \brief [7:7] T12 Operating Mode (rw) */
    unsigned int T13CLK:3;                  /**< \brief [10:8] Timer T13 Input Clock Select (rw) */
    unsigned int T13PRE:1;                  /**< \brief [11:11] Timer T13 Prescaler Bit (rw) */
    unsigned int T13R:1;                    /**< \brief [12:12] Timer T13 Run Bit (rh) */
    unsigned int STE13:1;                   /**< \brief [13:13] Timer T13 Shadow Transfer Enable (rh) */
    unsigned int reserved_14:18;            /**< \brief \internal Reserved */
} Ifx_CCU6_TCTR0_Bits;

/** \brief  Timer Control Register 2 */
typedef struct _Ifx_CCU6_TCTR2_Bits
{
    unsigned int T12SSC:1;                  /**< \brief [0:0] Timer T12 Single Shot Control (rw) */
    unsigned int T13SSC:1;                  /**< \brief [1:1] Timer T13 Single Shot Control (rw) */
    unsigned int T13TEC:3;                  /**< \brief [4:2] T13 Trigger Event Control (rw) */
    unsigned int T13TED:2;                  /**< \brief [6:5] Timer T13 Trigger Event Direction (rw) */
    unsigned int reserved_7:1;              /**< \brief \internal Reserved */
    unsigned int T12RSEL:2;                 /**< \brief [9:8] Timer T12 External Run Selection (rw) */
    unsigned int T13RSEL:2;                 /**< \brief [11:10] Timer T13 External Run Selection (rw) */
    unsigned int reserved_12:20;            /**< \brief \internal Reserved */
} Ifx_CCU6_TCTR2_Bits;

/** \brief  Timer Control Register 4 */
typedef struct _Ifx_CCU6_TCTR4_Bits
{
    unsigned int T12RR:1;                   /**< \brief [0:0] Timer T12 Run Reset (w) */
    unsigned int T12RS:1;                   /**< \brief [1:1] Timer T12 Run Set (w) */
    unsigned int T12RES:1;                  /**< \brief [2:2] Timer T12 Reset (w) */
    unsigned int DTRES:1;                   /**< \brief [3:3] Dead-Time Counter Reset (w) */
    unsigned int reserved_4:1;              /**< \brief \internal Reserved */
    unsigned int T12CNT:1;                  /**< \brief [5:5] Timer T12 Count Event (w) */
    unsigned int T12STR:1;                  /**< \brief [6:6] Timer T12 Shadow Transfer Request (w) */
    unsigned int T12STD:1;                  /**< \brief [7:7] Timer T12 Shadow Transfer Disable (w) */
    unsigned int T13RR:1;                   /**< \brief [8:8] Timer T13 Run Reset (w) */
    unsigned int T13RS:1;                   /**< \brief [9:9] Timer T13 Run Set (w) */
    unsigned int T13RES:1;                  /**< \brief [10:10] Timer T13 Reset (w) */
    unsigned int reserved_11:2;             /**< \brief \internal Reserved */
    unsigned int T13CNT:1;                  /**< \brief [13:13] Timer T13 Count Event (w) */
    unsigned int T13STR:1;                  /**< \brief [14:14] Timer T13 Shadow Transfer Request (w) */
    unsigned int T13STD:1;                  /**< \brief [15:15] Timer T13 Shadow Transfer Disable (w) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_TCTR4_Bits;

/** \brief  Trap Control Register */
typedef struct _Ifx_CCU6_TRPCTR_Bits
{
    unsigned int TRPM0:1;                   /**< \brief [0:0] Trap Mode Control Bits 1, 0 (rw) */
    unsigned int TRPM1:1;                   /**< \brief [1:1] Trap Mode Control Bits 1, 0 (rw) */
    unsigned int TRPM2:1;                   /**< \brief [2:2] Trap Mode Control Bit 2 (rw) */
    unsigned int reserved_3:5;              /**< \brief \internal Reserved */
    unsigned int TRPEN:6;                   /**< \brief [13:8] Trap Enable Control (rw) */
    unsigned int TRPEN13:1;                 /**< \brief [14:14] Trap Enable Control for Timer T13 (rw) */
    unsigned int TRPPEN:1;                  /**< \brief [15:15] Trap Pin Enable (rw) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_CCU6_TRPCTR_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Ccu6_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_ACCEN0_Bits B;                 /**< \brief Bitfield access */
} Ifx_CCU6_ACCEN0;

/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_ACCEN1_Bits B;                 /**< \brief Bitfield access */
} Ifx_CCU6_ACCEN1;

/** \brief  Capture/Compare Register for Channel CC60 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_CC60R_Bits B;                  /**< \brief Bitfield access */
} Ifx_CCU6_CC60R;

/** \brief  Capture/Compare Shadow Reg. for Channel CC60 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_CCU6_CC60SR_Bits B;                 /**< \brief Bitfield access */
} Ifx_CCU6_CC60SR;

